// 实现函数 输入整数 a 和 b, 如果 a + b 大于 100, 则返回两输之差，否则返回两数之和

// 实现函数 输入一个年份 判断是否是闰年

// 标准体重 男士体重=身高-100+-3 女士体重=身高-110+-3 实现函数 输入相关参数 判断是否是标准体重

// 一个游戏一共50关,前20关是每一关自身的分数,21-30关每一关是10分,31-40关,每一关是20分,41-49关,每一关是30分,50关,是100分 
// 输入你现在闯到的关卡数,获取分数

// 找出元素 item 在给定数组 arr 中的位置 如果数组中存在 item ，则返回元素在数组中的位置，否则返回 -1

// 移除数组 arr 中所有值与 item 相等的元素。不要直接修改数组 arr, 结果返回新的数组

// 移除数组 arr 中所有值与 item 相等的元素。直接修改数组 arr, 并返回结果

// 在数组 arr 末尾添加元素 item，不要直接修改数组 arr 结果返回新的数组

// 删除数组 arr 末尾最后一个元素，不要直接修改数组 arr 结果返回新的数组

// 在数组 arr 开头添加元素 item。不要直接修改数组 arr，结果返回新的数组

// 统计数组 arr 中值等于 item 的元素出现的次数

// 找出数组 arr 中重复出现过的元素

// 为数组 arr 中的每个元素求二次方。不要直接修改数组 arr，结果返回新的数组

// 在数组 arr 中，查找值与 item 相等的元素出现的所有位置

// 实现 fizzBuzz 函数，参数 num 与返回值的关系如下：
// 1、如果 num 能同时被 3 和 5 整除，返回字符串 fizzbuzz
// 2、如果 num 能被 3 整除，返回字符串 fizz
// 3、如果 num 能被 5 整除，返回字符串 buzz
// 4、如果参数为空或者不是 Number 类型，返回 false
// 5、其余情况，返回参数 num